/*Напишите программу, которая на вход принимает
 два числа и выдаёт, какое число большее, а какое меньшее*/
/*Console.Write("Введите первое число: ");
int number1 = int.Parse (Console.ReadLine());
Console.Write("Введите второе число: ");
int number2 = int.Parse (Console.ReadLine());
if (number1>number2)
{
    Console.WriteLine($"Число {number1} больше числа {number2}");
}
else if (number2>number1)
{
     Console.WriteLine($"Число {number2} больше числа {number1}");
}
else 
{
     Console.WriteLine($"Числа {number2}  {number1} равны");
}*/

/*Напишите программу,
 которая принимает на вход три числа и выдаёт максимальное из этих чисел.*/
 /*Console.Write("Введите число1: ");
int number1 = int.Parse (Console.ReadLine());
Console.Write("Введите число2: ");
int number2 = int.Parse (Console.ReadLine());
Console.Write("Введите число3: ");
int number3 = int.Parse (Console.ReadLine());
int max = number1;
if(number2 > max)
{
    max = number2;
}
if(number3 > max)
{
    max = number3;
}
Console.WriteLine(max);*/


/*Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка)*/

/*Console.Write("Введите число: ");
int number = int.Parse (Console.ReadLine());
if(number %2==0)
{
    Console.WriteLine($"Да");
}
else 
{
    Console.WriteLine($"Нет");
}*/
